Revit 2027 API
BuiltInFailures.StructuralConnectionFailures Class
 Failures about StructuralConnectionHandler.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class StructuralConnectionFailures
Public NotInheritable Class StructuralConnectionFailures
public ref class StructuralConnectionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralConnectionFailures = class end
The BuiltInFailures.StructuralConnectionFailures type exposes the following members.
Properties
Name | Description
StructuralConnectionCannotGenerate |  Could not create Structural Connection Handler
StructuralConnectionCannotReplaceRefs |  Structural Connection cannot replace elements
StructuralConnectionForbiddenElementInGroup |  Fabrication element can not be a group member.
StructuralConnectionNoSingleRef |  Summary: Structural Connection Handler lost connected element.
StructuralConnectionNotEnoughRefs |  Structural Connection Handler cannot connect fewer than two elements.
StructuralConnectionSetOfRefsChanged |  The set of input elements was changed and the connection has been adjusted.
StructuralConnectionTooFarNotEnoughRefs |  Structural Connection Handler cannot connect too far elements
StructuralConnectionTooFarRefs |  Structural Connection Handler cannot connect too far elements
StructuralConnectionTypeChangedToGeneric |  Structural Connection had an inappropriate type, which has been changed to 'Generic Connection'.
StructuralConnectionTypeInfoNotAvailable |  There is no add-on installed which supports Structural Connection type.
StructuralConnectionWrongType |  Structural Connection has an inappropriate type assigned.
StructuralSectionHasIncompleteDefinition |  Structural Section has incomplete definition
Top
See Also
Reference
Autodesk.Revit.DB Namespace